load-test.yml
config:
  target: 'http://localhost:3001'
  phases:
    - duration: 60
      arrivalRate: 10
      name: Warm up
    - duration: 120
      arrivalRate: 50
      name: Load test
  defaults:
    headers:
      Content-Type: 'application/json'
scenarios:
  - name: 'Home page'
    weight: 70
    flow:
      - get:
          url: '/'
  - name: 'Health check'
    weight: 30
    flow:
      - get:
          url: '/health'